# ImportOptions3DM Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImportOptions3DM Class
Members See Also
---
The import options used to import 3DM format files.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public class ImportOptions3DM : BaseImportOptions
```

Visual Basic
---
```text
Public Class ImportOptions3DM _
	Inherits BaseImportOptions
```

Visual C++
---
```text
public ref class ImportOptions3DM : public BaseImportOptions
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BaseImportOptions Autodesk.Revit.DB..::..ImportOptions3DM
# See Also
ImportOptions3DM Members
Autodesk.Revit.DB Namespace